SPL to find missing Forwarder | Host is the forwarder device

index=* OR index=_* host=wssc-15*

index=* OR index=_* host=wssc-154129


Preview Search for details about metric data going into a particular index

| mpreview index=unix_summary


Count the # of Endpoints in a Splunk Environment 

index=_internal sourcetype=splunkd | stats dc(host) AS count  

| metadata index=* type=hosts   


Search & count the Sourcetypes in an environment

| tstats count where index=* by sourcetype


Search & count the index in an environment

| tstats count where index=* by index


List all sourcetype grouped by index

| tstats values(sourcetype) where index=* by index

Show list of data sources in an environment
| tstats values(sourcetype) AS sourcetype where index=* by index

| tstats values(sourcetype) where index=* sourcetype=infoblox:file by index


--------


Input Lookup CMD

| inputlookup <lookup_name>

| inputlookup <lookup_name> | where <condition>

| inputlookup <lookup_name> | rex <regular_expression> | search <field_name>=<value>

| inputlookup <lookup_name> | search NOT <field_name>="<value_to_exclude>"


--------


--- Tstats ---

Always use tstats to search datamodels 

| datamodel Email search   ## See events of a datamodel

| tstats count FROM datamodel=Email where All_Email.action=blocked by All_Email.return_addr

| tstats count from datamodel=Endpoint   ## Count the total # of endpoints in an environment 



--- Tstats Query Options ---

List all sourcetype grouped by index

| tstats values(sourcetype) where index=* by index


| tstats sum(bytes) where index=* by sourcetype


values: Returns unique values for the specified field.

| tstats values(host) where index=* by sourcetype


dc (distinct count): Returns the number of unique values for the specified field.

| tstats dc(host) where index=* by sourcetype


Latest and earliest: Returns the latest or earliest timestamp for the events matching the specified criteria.

| tstats latest(_time) as latestTime where index=* by sourcetype


Count how much data & if logs are being ingested into a particular index

| tstats count where index=checkpoint* by _time span=1d


---- Assests & Identity ----

List all Assets
|`assets`

List all Assets /w priority=critical 
| `assets` 
| search priority=critical

List all Identities
| `identities`

